2.Formula_one_CFD/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: 
// Export date: 2022-08-08 08:15:01.281208

convertToMeters 1;

vertices
(
    (-6.0 0.0 -0.32261)
    (14.0 0.0 -0.32261)
    (14.0 6.0 -0.32261)
    (-6.0 6.0 -0.32261)
    (-6.0 0.0 8.0)
    (14.0 0.0 8.0)
    (14.0 6.0 8.0)
    (-6.0 6.0 8.0) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (116 42 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);
