2.Formula_one_CFD/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: 
// Export date: 2022-08-08 08:15:03.000392

numberOfSubdomains 4;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 4);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 4);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
