2.Formula_one_CFD/Allrun
#https://github.com/frixlee/openfoam_cases

#!/bin/bash

foamListTimes -rm 

blockMesh

surfaceFeatures

snappyHexMesh -overwrite

potentialFoam

simpleFoam